app/controllers/games_controller.rb

  def create
    @game = Game.new(surve_a: 1, surve_b: 1, player_a: "プレイヤー1", player_b: "プレイヤー2", score_a: 0, score_b: 0)
    @game.save
---
INSERT INTO "games" ("player_a", "player_b", "surve_a", "surve_b", "score_a", "score_b", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @game = Game.find_by(id: params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def destroy
    @game = Game.find_by(id: params[:id])
    @game.destroy
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 4]]

  def create_surve_a
    @game = Game.find_by(id: params[:id])
    @game.surve_a = 4
    @game.surve_b = 2
    @game.save
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "games" SET "surve_a" = ?, "surve_b" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["surve_a", "2"], ["surve_b", "1"], ["updated_at", "2020-05-26 13:44:27.211956"], ["id", 14]]

  def create_surve_b
    @game = Game.find_by(id: params[:id])
    @game.surve_a = 2
    @game.surve_b = 4
    @game.save
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "games" SET "surve_a" = ?, "surve_b" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["surve_a", "1"], ["surve_b", "2"], ["updated_at", "2020-05-26 13:44:28.841976"], ["id", 14]]

  def surve_reset
    @game = Game.find_by(id: params[:id])
    @game.surve_a = 0
    @game.surve_b = 0
    @game.save
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "games" SET "surve_a" = ?, "surve_b" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["surve_a", "0"], ["surve_b", "0"], ["updated_at", "2020-05-26 13:44:30.670042"], ["id", 14]]

  def create_player_a
    @player = Member.find_by(id: params[:member_id])
    @game = Game.find_by(id: params[:game_id])
    @game.player_a = @player.name
    @game.save
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "games" SET "player_a" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["player_a", "テスト１"], ["updated_at", "2020-05-26 15:09:32.588142"], ["id", 16]]

  def create_player_b
    @player = Member.find_by(id: params[:member_id])
    @game = Game.find_by(id: params[:game_id])
    @game.player_b = @player.name
    @game.save
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "games" SET "player_b" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["player_b", nil], ["updated_at", "2020-05-26 15:10:08.084507"], ["id", 16]]

  def player_reset_a
    @game = Game.find_by(id: params[:game_id])
    @game.player_a = "プレイヤー1"
    @game.save
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "games" SET "player_a" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["player_a", "プレイヤー1"], ["updated_at", "2020-05-26 15:55:46.070903"], ["id", 21]]

  def player_reset_b
    @game = Game.find_by(id: params[:game_id])
    @game.player_b = "プレイヤー2"
    @game.save
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
UPDATE "games" SET "player_b" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["player_b", "プレイヤー2"], ["updated_at", "2020-05-26 15:57:36.602037"], ["id", 22]]

  def show
    @game = Game.find_by(id: params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]

  def plus

    @game = Game.find_by(id: params[:game_id])

    if @game.score_a >= 10 && @game.score_b >= 10

      @game.surve_a = @game.surve_a + 2
      @game.surve_b = @game.surve_b + 2

    else

      @game.surve_a = @game.surve_a + 1
      @game.surve_b = @game.surve_b + 1

    end

    if params[:player] == "1"
      @game.score_a = @game.score_a + 1
    elsif params[:player] == "2"
      @game.score_b = @game.score_b + 1
    end

    @game.save
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
UPDATE "games" SET "surve_a" = ?, "surve_b" = ?, "score_b" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["surve_a", "12"], ["surve_b", "14"], ["score_b", "11"], ["updated_at", "2020-05-28 08:55:47.451594"], ["id", 27]]

  def minus

    @game = Game.find_by(id: params[:game_id])

    if @game.score_a >= 10 && @game.score_b >= 10

      @game.surve_a = @game.surve_a - 2
      @game.surve_b = @game.surve_b - 2

    else

    @game.surve_a = @game.surve_a - 1
    @game.surve_b = @game.surve_b - 1

    end

    if params[:player] == "1"
      @game.score_a = @game.score_a - 1
    elsif params[:player] == "2"
      @game.score_b = @game.score_b - 1
    end

    @game.save
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
UPDATE "games" SET "surve_a" = ?, "surve_b" = ?, "score_b" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["surve_a", "4"], ["surve_b", "2"], ["score_b", "0"], ["updated_at", "2020-05-28 13:03:28.541982"], ["id", 34]]

  def result
    @game = Game.find_by(id: params[:game_id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]

  def record
    @game = Game.find_by(id: params[:game_id])
    @player1 = Member.find_by(name: @game.player_a)
    @player2 = Member.find_by(name: @game.player_b)

      if params[:player] == "1"
        @player1.win = @player1.win + 1
        @player2.lose = @player2.lose + 1
      elsif params[:player] == "2"
        @player2.win = @player2.win + 1
        @player1.lose = @player1.lose + 1
      end

    @player1.save
    @player2.save
    @game.destroy
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."name" = ? LIMIT ?  [["name", "test1"], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."name" = ? LIMIT ?  [["name", "test2"], ["LIMIT", 1]]
UPDATE "members" SET "win" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["win", 1], ["updated_at", "2020-05-28 14:21:56.872419"], ["id", 1]]
UPDATE "members" SET "lose" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["lose", 1], ["updated_at", "2020-05-28 14:21:56.899121"], ["id", 2]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]

  def back
    @game = Game.find_by(id: params[:game_id])

    if params[:player] == "1"
      @game.score_a = @game.score_a - 1

      if @game.score_a >= 10 && @game.score_b >= 10
        @game.surve_a = @game.surve_a - 2
        @game.surve_b = @game.surve_b - 2
      else
        @game.surve_a = @game.surve_a - 1
        @game.surve_b = @game.surve_b - 1
      end

    elsif params[:player] == "2"
      @game.score_b = @game.score_b - 1

      if @game.score_a >= 10 && @game.score_b >= 10
        @game.surve_a = @game.surve_a - 2
        @game.surve_b = @game.surve_b - 2
      else
        @game.surve_a = @game.surve_a - 1
        @game.surve_b = @game.surve_b - 1
      end
    end

    @game.save
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "games" SET "score_a" = ?, "surve_a" = ?, "surve_b" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["score_a", 13], ["surve_a", 34], ["surve_b", 32], ["updated_at", "2020-05-28 14:19:40.034576"], ["id", 1]]