app/controllers/members_controller.rb

INSERT INTO "members" ("created_at", "updated_at", "name", "win", "lose") VALUES (?, ?, ?, ?, ?)  [["created_at", "2020-05-28 12:46:21.208833"], ["updated_at", "2020-05-28 12:46:21.208833"], ["name", "test1"], ["win", "0"], ["lose", "0"]]
---
  def create
    @member = Member.new(name: params[:member_name], win: 0, lose: 0)
    @member.save

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 2]]
---
  def destroy
    @member = Member.find_by(id: params[:id])
    @member.destroy

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @member = Member.find_by(id: params[:id])

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "members" SET "name" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["name", "params[:name]"], ["updated_at", "2020-05-25 09:10:36.748429"], ["id", 2]]
---
  def update
    @member = Member.find_by(id: params[:id])
    @member.name = params[:member_name]
    @member.save